QuantumLeaps/qpc/3rd_party/nucleo-h743zi/Drivers/BSP/STM32H7xx_Nucleo_144/stm32h7xx_nucleo_144.c
  /* LCD SPI Config */
  SPIx_Init();
}

/**
  * @brief  Writes command to select the LCD register.
  * @param  LCDReg: Address of the selected register.
  * @retval None
  */
void LCD_IO_WriteReg(uint8_t LCDReg)
{
  /* Reset LCD control line CS */
  LCD_CS_LOW();

  /* Set LCD data/command line DC to Low */
  LCD_DC_LOW();

  /* Send Command */
  SPIx_Write(LCDReg);

  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}

/**
  * @brief  Writes data to select the LCD register.
  *         This function must be used after st7735_WriteReg() function
  * @param  Data: data to write to the selected register.
  * @retval None
  */
void LCD_IO_WriteData(uint8_t Data)
{
  /* Reset LCD control line CS */
  LCD_CS_LOW();

  /* Set LCD data/command line DC to High */
  LCD_DC_HIGH();

  /* Send Data */
  SPIx_Write(Data);

  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}

/**
* @brief  Write register value.
* @param  pData Pointer on the register value
* @param  Size Size of byte to transmit to the register
* @retval None
*/
void LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size)
{
  uint32_t counter = 0;
  __IO uint32_t data = 0;

  /* Reset LCD control line CS */
  LCD_CS_LOW();

  /* Set LCD data/command line DC to High */
  LCD_DC_HIGH();

  if (Size == 1)
  {
    /* Only 1 byte to be sent to LCD - general interface can be used */
    /* Send Data */
    SPIx_Write(*pData);
  }
  else
  {

    /* Enable SPI peripheral */
    __HAL_SPI_ENABLE(&hnucleo_Spi);

    /* Reset the SPI Data length and data reload*/
    hnucleo_Spi.Instance->CR2 = 0;

    /* Master transfer start */
    SET_BIT(hnucleo_Spi.Instance->CR1, SPI_CR1_CSTART);

    /* Several data should be sent in a raw */
    /* Direct SPI accesses for optimization */
    for (counter = Size; counter != 0; counter--)
    {
      while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
      {
      }
      /* Need to invert bytes for LCD*/
      *((__IO uint8_t*)&hnucleo_Spi.Instance->TXDR) = *(pData+1);

      /* Wait until the bus is ready before releasing Chip select */
      while(((hnucleo_Spi.Instance->SR) & SPI_SR_TXC) == RESET)
      {
      }
      __HAL_SPI_CLEAR_EOTFLAG(&hnucleo_Spi);
      /* Empty the Rx fifo */
      data = *(&hnucleo_Spi.Instance->RXDR);
      UNUSED(data);  /* Remove GNU warning */

      while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
      {
      }
      *((__IO uint8_t*)&hnucleo_Spi.Instance->TXDR) = *pData;

      /* Wait until the bus is ready before releasing Chip select */
      while(((hnucleo_Spi.Instance->SR) & SPI_SR_TXC) == RESET)
      {
      }
      __HAL_SPI_CLEAR_EOTFLAG(&hnucleo_Spi);
      /* Empty the Rx fifo */
      data = *(&hnucleo_Spi.Instance->RXDR);
      UNUSED(data);  /* Remove GNU warning */

      counter--;
      pData += 2;
    }

    /* Clear TXTF Flag : Tx FIFO Threshold */
    __HAL_SPI_CLEAR_TXTFFLAG(&hnucleo_Spi);

    /* Disable SPI peripheral */
    __HAL_SPI_DISABLE(&hnucleo_Spi);
  }

  /* Deselect : Chip Select high */
  LCD_CS_HIGH();

  /* add delay after each SPI command to avoid saturating the Adafruit LCD controller
     mandatory as the STM32H743I CPU (CM7) is running at 400 MHz */
  for (counter = 256; counter != 0; counter--)
  {
    __NOP();
  }

}

/**
  * @brief  Wait for loop in ms.
  * @param  Delay in ms.
  * @retval None
  */
void LCD_Delay(uint32_t Delay)
{
  HAL_Delay(Delay);
}
#endif /* HAL_SPI_MODULE_ENABLED */

/******************************* ADC driver ********************************/
#ifdef HAL_ADC_MODULE_ENABLED

/**
  * @brief  Initializes ADC MSP.
  * @param  hadc: ADC handle
  * @retval None
  */
static void ADCx_MspInit(ADC_HandleTypeDef *hadc)
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  static RCC_PeriphCLKInitTypeDef  periph_clk_init_struct;

  /*** Configure the GPIOs ***/
  /* Enable GPIO clock */
  NUCLEO_ADCx_GPIO_CLK_ENABLE();

  /* Configure the selected ADC Channel as analog input */
  GPIO_InitStruct.Pin = NUCLEO_ADCx_GPIO_PIN ;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(NUCLEO_ADCx_GPIO_PORT, &GPIO_InitStruct);

  /* ADC clock configuration */
  /* PLL2_VCO Input = HSE_VALUE/PLL3M = 8/4  = 2 Mhz */
  /* PLL2_VCO Output = PLL2_VCO Input * PLL2N = 400 Mhz */
  /* ADC Clock = PLL2_VCO Output/PLL2P = 400/6 = 66,6 Mhz */
  periph_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  periph_clk_init_struct.PLL2.PLL2M = 4;
  periph_clk_init_struct.PLL2.PLL2N = 200;
  periph_clk_init_struct.PLL2.PLL2P = 6;
  periph_clk_init_struct.PLL2.PLL2Q = 2;
  periph_clk_init_struct.PLL2.PLL2R = 2;
  HAL_RCCEx_PeriphCLKConfig(&periph_clk_init_struct);

  /*** Configure the ADC peripheral ***/
  /* Enable ADC clock */
  NUCLEO_ADCx_CLK_ENABLE();
}

/**
  * @brief  DeInitializes ADC MSP.
  * @param  hadc: ADC handle
  * @note ADC DeInit does not disable the GPIO clock
  * @retval None
  */
static void ADCx_MspDeInit(ADC_HandleTypeDef *hadc)
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*** DeInit the ADC peripheral ***/
  /* Disable ADC clock */
  NUCLEO_ADCx_CLK_DISABLE();

  /* Configure the selected ADC Channel as analog input */
  GPIO_InitStruct.Pin = NUCLEO_ADCx_GPIO_PIN ;
  HAL_GPIO_DeInit(NUCLEO_ADCx_GPIO_PORT, GPIO_InitStruct.Pin);

  /* Disable GPIO clock has to be done by the application*/
  /* NUCLEO_ADCx_GPIO_CLK_DISABLE(); */
}

/**
  * @brief  Initializes ADC HAL.
  * @retval None
  */
static void ADCx_Init(void)
{
  hnucleo_Adc.Instance                   = NUCLEO_ADCx;

  if(HAL_ADC_GetState(&hnucleo_Adc) == HAL_ADC_STATE_RESET)
  {
    /* ADC Config */
    hnucleo_Adc.Instance                   = NUCLEO_ADCx;
    hnucleo_Adc.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV4;
    hnucleo_Adc.Init.Resolution            = ADC_RESOLUTION_12B;
    hnucleo_Adc.Init.ContinuousConvMode    = DISABLE;
    hnucleo_Adc.Init.DiscontinuousConvMode = DISABLE;
    hnucleo_Adc.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hnucleo_Adc.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
    hnucleo_Adc.Init.NbrOfConversion       = 1;

    ADCx_MspInit(&hnucleo_Adc);
    HAL_ADC_Init(&hnucleo_Adc);
  }
}

/**
  * @brief  Initializes ADC HAL.
  * @retval None
  */
static void ADCx_DeInit(void)
{
    hnucleo_Adc.Instance   = NUCLEO_ADCx;

